# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [8]:
list1=[2, 4, 6, 8, 10]
list2=[1, 3, 5, 7, 9]

listadd=[]
listsub=[]
listmul=[]
listdiv=[]

for i in range(len(list1)):
    listadd.append(list1[i]+list2[i])
    listsub.append(list1[i]-list2[i])
    listmul.append(list1[i]*list2[i])
    listdiv.append(list1[i]/list2[i])


print("addition value of two lists={}".format(listadd))
print("subtraction value of two lists={}".format(listsub))
print("multiplication value of two lists={}".format(listmul))
print("division value of two lists={}".format(listdiv))

addition value of two lists=[3, 7, 11, 15, 19]
subtraction value of two lists=[1, 1, 1, 1, 1]
multiplication value of two lists=[2, 12, 30, 56, 90]
division value of two lists=[2.0, 1.3333333333333333, 1.2, 1.1428571428571428, 1.1111111111111112]

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [10]:
import pandas as pd

newdict={'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}

newseries=pd.Series(newdict)

print(newseries)

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [20]:
import pandas as pd
newser1=pd.Series(['100','200','python','300.12','400'])
print(newser1)



#converted series

num_newser1=pd.to_numeric(newser1,errors='coerce')
print("new series converted to numeric is :")
print(num_newser1)

0       100
1       200
2    python
3    300.12
4       400
dtype: object
new series converted to numeric is :
0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [30]:
df1=pd.DataFrame({'col1': [1, 2, 3, 4, 7, 11],
                  'col2': [4, 5, 6, 9, 5, 0], 
                  'col3': [7, 5, 8, 12, 1,11]})

#sample head of dataframe created
print(df1.head())

print('\n')

print('printing first column \n')

column1=df1.iloc[:,0]
print(column1)
print(type(column1))

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1


printing first column

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64
<class 'pandas.core.series.Series'>

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [37]:
from statistics import stdev 

givseries=pd.Series([1,2,3,4,5,6,7,8,9,5,3])

givseries_mean=givseries.mean()

givseries_std=stdev(givseries)


print("series structure is as follows:{}\n".format(givseries))


print("Mean of the said Data Series is :{} \n".format(givseries_mean))

print("standard deviation of the said Data Series is :{}\n".format(givseries_std))

series structure is as follows:0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int64

Mean of the said Data Series is :4.818181818181818

standard deviation of the said Data Series is :2.522624895547565

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [38]:
df6 = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
print(df6)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [43]:
import numpy as np
dataframe7 =pd.DataFrame( {'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
'qualify':[ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19]
 },
index = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ])

dataframe7.head(3)

   attempts       name qualify  score
a         1  Anastasia     yes   12.5
b         3       Dima      no    9.0
c         2  Katherine     yes   16.5

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [50]:
exam_data =pd.DataFrame({'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael','Matthew', 'Laura', 'Kevin', 'Jonas'],
'score':[12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify':['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] },
index = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j'])

exam_data.iloc[[1,3,5,6],[0,1]]

       name   score
 b      Dima    9.0
 d     James    NaN
 f   Michael   20.0
 g   Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [53]:
print("Mean score for each different student in data frame is : {}".format(exam_data['score'].mean()))

Mean score for each different student in data frame is : 13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [66]:
samp_dataframe=pd.DataFrame({'col1':[1,2,3],'col2':[4,5,6],'col3':[7,8,9]})

print("printing original dataframe:")
print(samp_dataframe)
print('\n')

renamedata=samp_dataframe.rename(columns={'col1':'column1','col2':'column2','col3':'column3'})

print("printing renamed dataframe:")
print(renamedata)

printing original dataframe:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9


printing renamed dataframe:
   column1  column2  column3
0        1        4        7
1        2        5        8
2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [67]:
df_city = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
g1 = df_city.groupby(["city"]).size().reset_index(name='Number of people')
print(g1)

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [70]:
samp_df = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})
pd.set_option('display.max_rows', 400)
pd.set_option('display.max_columns', 400)
pd.set_option('display.width', 900)
print("Original DataFrame")
print(samp_df)

Original DataFrame
   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [72]:
new_series = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
print("String Date:{}".format(new_series))

datetime_series = pd.to_datetime(new_series)
datetime_frame = pd.DataFrame(datetime_series)
print("Original DataFrame (string to datetime):")
print(datetime_frame)

String Date:0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object
Original DataFrame (string to datetime):
           0
0 2000-03-11
1 2000-03-12
2 2000-03-13

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [83]:
empty_dataframe=pd.DataFrame(columns=['col1','col2'])

print("printing emtydataframe:")
empty_dataframe.head()


empty_dataframe['col1']=range(3)
empty_dataframe['col2']=range(3)

print("printing data appended dataframe:")
empty_dataframe.head()

printing emtydataframe:
printing data appended dataframe:

   col1  col2
0     0     0
1     1     1
2     2     2

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [86]:
samp_df = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})

print("number of columns of dataframe is:{} ".format(len(samp_df.columns)))

number of columns of dataframe is:3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [90]:
samp_df = pd.DataFrame({'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]})

print(samp_df.head())

print('\n')
#deleting last 2 rows of dataframe
samp_df=samp_df[:-2]

print("printing dataframe after deleting last 2 rows")
samp_df.head()

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1


printing dataframe after deleting last 2 rows

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [1]:
import xlrd
import pandas as pd
import numpy as np
coalpublic1=pd.read_excel('C:\\Users\\venkatar\\Desktop\\Srikanth\\asgmt\\coalpublic2013.xlsx')

In [4]:
coalpublic1.head(20)

    Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0   2013   103381            Tacoa Highwall Miner       56004        22392
1   2013   103404                Reid School Mine       28807        28447
2   2013   100759  North River #1 Underground Min     1440115       474784
3   2013   103246                      Bear Creek       87587        29193
4   2013   103451                     Knight Mine      147499        46393
5   2013   103433              Crane Central Mine       69339        47195
6   2013   100329                    Concord Mine           0       144002
7   2013   100851                  Oak Grove Mine     2269014      1001809
8   2013   102901                Shoal Creek Mine           0        12396
9   2013   102901                Shoal Creek Mine     1453024      1237415
10  2013   103180             Sloan Mountain Mine      327780       196963
11  2013   103182                        Fishtrap      175058        87314
12  2013   103285                     Narley Mine      154861        90584
13  2013   103332                   Powhatan Mine      140521        61394
14  2013   103375                    Johnson Mine         580         1900
15  2013   103419               Maxine-Pratt Mine      125824       107469
16  2013   103432                   Skelton Creek        8252          220
17  2013   103437         Black Warrior Mine No 1      145924        70926
18  2013   102976   Piney Woods Preparation Plant           0        14828
19  2013   102976   Piney Woods Preparation Plant           0        23193

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [7]:
coalpublic1[coalpublic1['Mine_Name'].str.startswith("P")]

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [16]:
import xlrd
import pandas as pd
import numpy as np
employee1=pd.read_excel('C:\\Users\\venkatar\\Desktop\\Srikanth\\asgmt\\employee.xlsx')

In [17]:
employee1[employee1['hire_date']>'2007-01-01'].head()

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [18]:
employee2 = employee1.set_index(['hire_date'])
result = employee2["2007"]
result

            emp_id first_name   last_name
hire_date
2007-05-21     104      Bruce       Ernst
2007-02-07     107      Diana     Lorentz
2007-12-07     113       Luis        Popp
2007-08-10     119      Karen  Colmenares

## Great Job!